Revit 2027 API
Document.Save(SaveOptions) Method
 Saves the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Save(
	SaveOptions options
)
Public Sub Save (
	options As SaveOptions
)
public:
void Save(
	SaveOptions^ options
)
member Save :
        options : SaveOptions -> unit
Parameters
options SaveOptions
 Options to control the Save operation.
Exceptions
Exception | Condition
ArgumentException |  options.PreviewViewId is not valid for generation of a preview.
ArgumentNullException |  A non-optional argument was null
CentralModelException |  Central model is missing. -or- Central model is incompatible. -or- The central model was saved in a different version of Revit. -or- Revit encountered errors while saving to the new central model. Resave again as a new central model. -or- Incompatible servers for external services. -or- Username does not match the one used to create the local file. -or- Revit could not save all of the worksets that have been changed. Try again.
ForbiddenForDynamicUpdateException |  Save may not be called during dynamic update.
InsufficientResourcesException |  This computer does not have enough memory, disk space, or other necessary resource to save the model.
InvalidOperationException |  This Document is not a primary document, it is a linked document. -or- Save is temporarily disabled. -or- Saving is not allowed in the current application mode. -or- File path must be already set to be able to save the document.It needs to be first saved using the SaveAs method instead. -or- The file is read-only, can not be saved. -or- Operation is not permitted when there is any open sub-transaction, transaction, or transaction group. -or- Saving failed.
OperationCanceledException |  Saving was canceled by the user or by an API event callback.
OutdatedDirectlyOpenedCentralException |  Other users have modified the central model while you had it opened. Resave your document as a local file and then synchronize with central again.
Remarks
 If the document was created in this current session and has not been saved to a file yet, it needs to be first saved using the SaveAs method instead.
 This method may not be called unless all transactions, sub-transactions, and transaction groups that were opened by the API code were closed. That also implies that this method cannot be called during dynamic updates. Event handlers are not allowed to save document that are currently in modifiable state.
See Also
Reference
Document Class
Save Overload
Autodesk.Revit.DB Namespace